In [1]:
import pandas as pd

In [2]:
account_info = pd.DataFrame({
    'name': ['Bob', 'Mary', 'Mita'],
    'account': [123846, 123972, 347209],
    'balance': [123, 3972, 7209]
})

In [3]:
account_info

   name  account  balance
0   Bob   123846      123
1  Mary   123972     3972
2  Mita   347209     7209

In [4]:
account_info.loc[1, 'balance']

3972

In [5]:
account_info.loc[:, ['name', 'balance']]

   name  balance
0   Bob      123
1  Mary     3972
2  Mita     7209